app/controllers/buyers_controller.rb

  def index
    @buyers = current_user.buyers.all
---
SELECT "buyers".* FROM "buyers" WHERE "buyers"."user_id" = ?  [[nil, 1]]

  def show
    @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @buyer = Buyer.find(params[:id])
    if @buyer.update(buyer_params)
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "buyers" SET "account" = ?, "updated_at" = ? WHERE "buyers"."id" = ?  [["account", "32413"], ["updated_at", "2018-10-01 00:36:42.812562"], ["id", 3]]

  def create
    @buyer = Buyer.new(buyer_params)
    @buyer.user = current_user
    if @buyer.save
---
INSERT INTO "buyers" ("alias", "name", "duty_paragraph", "account", "phone", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @buyer = Buyer.find(params[:id])
    @buyer.destroy
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "buyers" WHERE "buyers"."id" = ?  [["id", 2]]