app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."buyer_id" = ?  [[nil, 3]]
---
  def index
    @invoices = @buyer.invoices.all

SELECT "tax_categories".* FROM "tax_categories"
---
  def new
    @invoice = Invoice.new
    @tax_categories = TaxCategory.all

SELECT  "tax_categories".* FROM "tax_categories" WHERE "tax_categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "invoices" ("standard", "unit", "buyer_id", "tax_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["standard", "3333"], ["unit", "dasfd"], ["buyer_id", 1], ["tax_category_id", 1], ["created_at", "2018-09-30 23:39:23.567016"], ["updated_at", "2018-09-30 23:39:23.567016"]]
---
  def create
    @invoice = Invoice.new(invoice_params)
    @invoice.buyer = @buyer
    @tax_category = TaxCategory.find(tax_category_params[:tax_category_id])
    @invoice.tax_category = @tax_category
    if @invoice.save

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @invoice = Invoice.find(params[:id])

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tax_categories".* FROM "tax_categories"
---
  def edit
    @invoice = Invoice.find(params[:id])
    @tax_categories = TaxCategory.all

SELECT  "tax_categories".* FROM "tax_categories" WHERE "tax_categories"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "invoices" SET "tax_category_id" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["tax_category_id", 2], ["updated_at", "2018-10-01 00:35:57.468272"], ["id", 7]]
---
  def update
    @tax_category = TaxCategory.find(tax_category_params[:tax_category_id])
    @invoice = Invoice.find(params[:id])
    @invoice.tax_category = @tax_category
    if @invoice.update(invoice_params)

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 1]]
---
  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy

SELECT "invoices".* FROM "invoices"
---
  def export_xml
    file = File.new(File.join(Rails.root, "public", 'test.xml'),"w+")
    doc = REXML::Document.new
    kp = doc.add_element ('Kp')
    version = kp.add_element( 'Version')
    version.add_text "2.0"
    fpxx = kp.add_element('Fpxx')
    zsl = fpxx.add_element('Zsl')
    zsl.add_text "1"
    fpsj = fpxx.add_element('Fpsj')
    fp = fpsj.add_element('Fp')
    djh = fp.add_element('Djh')
    djh.add_text '1'
    gfmc = fp.add_element('Gfmc')
    gfmc.add_text '祈祷'
    gfsh = fp.add_element('Gfsh')
    gfyhzh = fp.add_element('Gfyhzh')
    gfdzdh = fp.add_element('Gfdzdh')
    bz = fp.add_element('Bz')
    fhr = fp.add_element('Fhr')
    skr = fp.add_element('Skr')
    spbmbbh = fp.add_element('Spbmbbh')
    spbmbbh.add_text '30.0'
    hsbz = fp.add_element('Hsbz')
    hsbz.add_text '30.0'
    sgbz = fp.add_element('Sgbz')
    sgbz.add_text '30.0'
    spxx = fp.add_element('Spxx')

    @invoices = Invoice.all