app/controllers/tax_categories_controller.rb

  def index
    @tax_categories = current_user.tax_categories.all
---
SELECT "tax_categories".* FROM "tax_categories" WHERE "tax_categories"."user_id" = ?  [[nil, 2]]

  def show
    @tax_category = TaxCategory.find(params[:id])
---
SELECT  "tax_categories".* FROM "tax_categories" WHERE "tax_categories"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @tax_category = TaxCategory.new(tax_category_params)
    @tax_category.user = current_user
    if @tax_category.save
---
INSERT INTO "tax_categories" ("name", "code", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "测试1"], ["code", "34214341"], ["user_id", 1], ["created_at", "2018-09-30 22:48:05.422548"], ["updated_at", "2018-09-30 22:48:05.422548"]]

  def destroy
    @tax_category = TaxCategory.find(params[:id])
    @tax_category.destroy
---
SELECT  "tax_categories".* FROM "tax_categories" WHERE "tax_categories"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tax_categories" WHERE "tax_categories"."id" = ?  [["id", 1]]